---
kind: type
id: T:Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
source: html/35970bc8-fcb2-42f9-fb6f-38ca919e5e2d.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementRoundingManager

A base class providing access to reinforcement rounding overrides for structural elements.

## Syntax (C#)
```csharp
public class ReinforcementRoundingManager : IDisposable
```

## Remarks
Subclasses of this class are used to access the override settings for Rebar elements and types or Fabric elements and types.